In [1]:
import pandas as pd


csv_data = """Name,Age,Department,Salary
Aarav,28,Sales,50000
Sneha,,Engineering,80000
Kabir,25,HR,
Anaya,29,,60000
Rohan,35,Engineering,85000
"""

with open('employees.csv', 'w') as f:
    f.write(csv_data)
df = pd.read_csv('employees.csv')

In [2]:
print(df.isnull())
print(df.isnull().sum())

    Name    Age  Department  Salary
0  False  False       False   False
1  False   True       False   False
2  False  False       False    True
3  False  False        True   False
4  False  False       False   False
Name          0
Age           1
Department    1
Salary        1
dtype: int64

In [4]:
df_cleaned = df.dropna()
print(df_cleaned)

    Name   Age   Department   Salary
0  Aarav  28.0        Sales  50000.0
4  Rohan  35.0  Engineering  85000.0

In [15]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Department'] = df['Department'].fillna("Unknown")

In [19]:
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())

In [20]:
print(df)

    Name    Age   Department   Salary
0  Aarav  28.00        Sales  50000.0
1  Sneha  29.25  Engineering  80000.0
2  Kabir  25.00           HR      0.0
3  Anaya  29.00      Unknown  60000.0
4  Rohan  35.00  Engineering  85000.0